In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv("income.csv",names=['name','income'],skiprows=[0])
df

        name    income
0        Rob      5000
1      Rafiq      6000
2       Nina      4000
3      Sofia      7500
4      Mohan      8000
5        Tao      7000
6  Elon Musk  10000000

# Percentile

In [3]:
df.describe()

             income
count  7.000000e+00
mean   1.433929e+06
std    3.777283e+06
min    4.000000e+03
25%    5.500000e+03
50%    7.000000e+03
75%    7.750000e+03
max    1.000000e+07

In [4]:
#calulate the 25th percentitle of tha dataset
df.income.quantile(0.5)       # 50th of the percentile

np.float64(7000.0)

In [5]:
df.income.quantile(0.25)      # 25th of the percentile        it gives (5000+6000)/2

np.float64(5500.0)

In [6]:
df.income.quantile(0.25,interpolation="lower")      # 25th of the percentile       instead of this it gives (5000+6000)/2 ,1st value i.e 5000

np.int64(5000)

In [7]:
df.income.quantile(0.25,interpolation="higher")      # 25th of the percentile       instead of this it gives (5000+6000)/2 ,1st value i.e 6000

np.int64(6000)

In [8]:
df.income.quantile(1)    # ->100percentile

np.float64(10000000.0)

In [9]:
ptile_99=df.income.quantile(0.99)
ptile_99

np.float64(9400479.999999994)

In [10]:
#give the record which greater than 99 percentile
df_outlier=df[df.income>ptile_99]
df_outlier

        name    income
6  Elon Musk  10000000

## Remove Outlier

In [11]:
#remove outlier     or #give the record which less than 99 percentile
df_no_outlier=df[df.income<=ptile_99]
df_no_outlier

    name  income
0    Rob    5000
1  Rafiq    6000
2   Nina    4000
3  Sofia    7500
4  Mohan    8000
5    Tao    7000

## Handling missing value 
        2 techinque -> 1.using Mean -> not get accuracy 
                       2. use of the median-> get accuracy in dataset

In [16]:
df["income"][3]=np.nan             #make sofia value as missing data

In [17]:
df

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia         NaN
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0

In [18]:
# if we use the mean for that it become the diseaster or complicated
df.income.mean()

np.float64(1671666.6666666667)

In [19]:
df_new=df.fillna(df.income.mean())           # this data has no sense i.e sofia's income is get in million
df_new

        name        income
0        Rob  5.000000e+03
1      Rafiq  6.000000e+03
2       Nina  4.000000e+03
3      Sofia  1.671667e+06
4      Mohan  8.000000e+03
5        Tao  7.000000e+03
6  Elon Musk  1.000000e+07

In [21]:
# for that we use the median technique
df_new=df.fillna(df.income.median())
df_new

        name      income
0        Rob      5000.0
1      Rafiq      6000.0
2       Nina      4000.0
3      Sofia      6500.0
4      Mohan      8000.0
5        Tao      7000.0
6  Elon Musk  10000000.0